classdef RobotParameters
    properties (Constant)
        % 基座参数
        m_b = 11.891;      % 基座质量 kg
        I_b = 0.079;       % 基座惯量 kg·m²
        b_b = 0.151;       % 基座质心到关节1距离 m
        
        % 连杆1参数
        m1 = 0.474;        % 连杆1质量 kg
        l1 = 0.225;        % 连杆1长度 m
        a1 = 0.1125;       % 关节1到连杆1质心距离 m
        I1 = 0.013;        % 连杆1惯量 kg·m²
        
        % 连杆2参数  
        m2 = 1.195;        % 连杆2质量 kg
        l2 = 0.276;        % 连杆2长度 m
        a2 = 0.138;        % 关节2到连杆2质心距离 m
        I2 = 0.031;        % 连杆2惯量 kg·m²

        %接触力计算
        K = 1e5;
        B = 500;
        R_ee = 0.05;
        R_t = 0.1;

        %阻抗控制器
        Md = 5;
        tau_max = 50;
        

    end
end


